# np.nan 与 none
- pandas中的none 和np.nan 都被视作np.nan
- None（object） 与 np.nan（float） 的类型不同，
- None是Python自带的，其类型为python object。因此，None不能参与到任何计算中
-

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [7]:
type(None)

NoneType

In [8]:
type(np.nan)

float

In [3]:
df = DataFrame(np.random.randint(0,100,size=(3,3)),index=list("abc"),columns=list("ABC"))
df

    A   B   C
a  70  50  61
b  88  17  76
c  78  90  26

In [4]:
df.loc["b","B"] = np.nan
df

    A     B   C
a  70  50.0  61
b  88   NaN  76
c  78  90.0  26

In [6]:
df.dtypes

A      int32
B    float64
C      int32
dtype: object

# pandas中的none与na.nan的操作
- isnull()  
- notnull()  
- dropna() =>过滤空值元素  
- fillna() =>填充空值元素

In [9]:
# 说明B列其中有空值
df.isnull().any()

A    False
B     True
C    False
dtype: bool

In [11]:
#说明A和C列，都没有空值
df.notnull().all()

A     True
B    False
C     True
dtype: bool

In [17]:
# 由于b行有空值， 所以删除d行的数据
#通过axis控制方向，默认0，行方向
#how参数 any |all 默认any,
df.dropna()

    A     B   C
a  70  50.0  61
c  78  90.0  26

In [18]:
#1 使用单个数值，填充为nan的项
df.fillna(value=10)

    A     B   C
a  70  50.0  61
b  88  10.0  76
c  78  90.0  26

In [21]:
user_df = DataFrame( data={
    "hight":[187,169,172],
    "weight":[90,88,76],
    "age":[22,19,25]
    }, index=["tony","mike","jake"]    
)
user_df.loc["tony","age"]=np.nan
user_df.loc["mike","weight"]=np.nan
user_df.loc["jake","hight"]=np.nan
user_df

      hight  weight   age
tony  187.0    90.0   NaN
mike  169.0     NaN  19.0
jake    NaN    76.0  25.0

In [22]:
# 使用每一列的聚合指标，对空值填充
user_df.mean()

hight     178.0
weight     83.0
age        22.0
dtype: float64

In [23]:
# 把每一列的均值，填入对应列的空值
user_df.fillna(value=user_df.mean())

      hight  weight   age
tony  187.0    90.0  22.0
mike  169.0    83.0  19.0
jake  178.0    76.0  25.0

In [ ]:
# {'backfill', 'bfill', 'ffill', None}, default None
# bfill 向后填充，ffill向前填充
user_df.fillna(axis=0, method='bfill')